// WBP_mock_test/WBP_constable/WBP_constable_mock1.js
var TEST_TIME_IN_SECONDS = 30;
var rawQuestions = [
    { question: "পশ্চিমবঙ্গের দীর্ঘতম নদী কোনটি?", options: ["ভাগীরথী-হুগলী", "দামোদর", "গঙ্গা", "তিস্তা"], correct: 2 },
    { question: "ভারতের বর্তমান রাষ্ট্রপতি কে?", options: ["দ্রৌপদী মুর্মু", "রামনাথ কোবিন্দ", "প্রতিভা পাতিল", "প্রণব মুখোপাধ্যায়"], correct: 0 },
    { question: "সিপাহী বিদ্রোহ কত সালে হয়েছিল?", options: ["১৮৫৭", "১৮৮৫", "১৮৫৯", "১৯০৫"], correct: 0 },
    { question: "সবুজ বিপ্লব কিসের সঙ্গে যুক্ত?", options: ["দুগ্ধ উৎপাদন", "কৃষি উৎপাদন", "মৎস্য চাষ", "পাখি পালন"], correct: 1 },
    { question: "কোন ভিটামিনের অভাবে রাতকানা রোগ হয়?", options: ["ভিটামিন বি", "ভিটামিন সি", "ভিটামিন এ", "ভিটামিন ডি"], correct: 2 },
    { question: "পৃথিবীর বৃহত্তম মহাদেশ কোনটি?", options: ["আফ্রিকা", "এশিয়া", "উত্তর আমেরিকা", "ইউরোপ"], correct: 1 },
    { question: "কত সালে ভারতীয় সংবিধান কার্যকর হয়?", options: ["১৯৪৭", "১৯৪৮", "১৯৫০", "১৯৫২"], correct: 2 },
    { question: "হিমোগ্লোবিনে কোন ধাতুটি থাকে?", options: ["ম্যাগনেসিয়াম", "লোহা", "কপার", "ক্যালসিয়াম"], correct: 1 },
    { question: "কলকাতা মেট্রো কত সালে চালু হয়?", options: ["১৯৭৫", "১৯৮৪", "১৯৯০", "১৯৯২"], correct: 1 },
    { question: "বিশ্ব পরিবেশ দিবস কবে পালিত হয়?", options: ["৫ই জুন", "৫ই জুলাই", "১৫ই আগস্ট", "২রা অক্টোবর"], correct: 0 },
    { question: "‘গানের পাখি’ কাকে বলা হয়?", options: ["সরোজিনী নাইডু", "লতা মঙ্গেশকর", "রবীন্দ্রনাথ ঠাকুর", "মাদার টেরিজা"], correct: 1 },
    { question: "কর্কটক্রান্তি রেখা পশ্চিমবঙ্গের কয়টি জেলার ওপর দিয়ে গেছে?", options: ["৪টি", "৫টি", "৩টি", "৬টি"], correct: 1 },
    { question: "কোন প্রাণীকে মরুভূমির জাহাজ বলা হয়?", options: ["ঘোড়া", "উট", "হাতি", "গাধা"], correct: 1 },
    { question: "ভারতের 'লৌহ মানব' কাকে বলা হয়?", options: ["জওহরলাল নেহরু", "সর্দার বল্লভভাই প্যাটেল", "মহাত্মা গান্ধী", "ভগত সিং"], correct: 1 },
    { question: "মানুষের শরীরে হাড়ের সংখ্যা কত?", options: ["২০২", "২০৬", "২১০", "২০০"], correct: 1 },
    { question: "কোনটি একটি ইনপুট ডিভাইস?", options: ["মনিটর", "প্রিন্টার", "কিবোর্ড", "স্পিকার"], correct: 2 },
    { question: "ভারতের জাতীয় পশুর নাম কী?", options: ["সিংহ", "রয়্যাল বেঙ্গল টাইগার", "হাতি", "ময়ূর"], correct: 1 },
    { question: "পানিপথের প্রথম যুদ্ধ কত সালে হয়?", options: ["১৫২৬", "১৫৫৬", "১৭৬১", "১৫২৭"], correct: 0 },
    { question: "জুলের একক কী?", options: ["ক্ষমতা", "কার্য বা শক্তি", "বল", "চাপ"], correct: 1 },
    { question: "পশ্চিমবঙ্গের রাজ্য পশুর নাম কী?", options: ["বাঘ", "মেছো বিড়াল", "একশৃঙ্গ গণ্ডার", "হাতি"], correct: 1 }
];
